perkowitz/hachi-yaeltex/hardware/yaeltex/samd/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

kilomux.name=Yaeltex Kilomux
kilomux.vid.0=0x04D8
kilomux.pid.0=0xEBBA
kilomux.vid.1=0x04D8
kilomux.pid.1=0xEBCA
kilomux.vid.2=0x04D8
kilomux.pid.2=0xEBCB
kilomux.vid.3=0x04D8
kilomux.pid.3=0xEBCC
kilomux.vid.4=0x04D8
kilomux.pid.4=0xEBCD
kilomux.vid.5=0x04D8
kilomux.pid.5=0xEBCE
kilomux.vid.6=0x04D8
kilomux.pid.6=0xEBCF
kilomux.vid.7=0x04D8
kilomux.pid.7=0xEBD0
kilomux.vid.8=0x04D8
kilomux.pid.8=0xEBD1
kilomux.vid.9=0x04D8
kilomux.pid.9=0xEBDE
kilomux.vid.10=0x04D8
kilomux.pid.10=0xEBDF
kilomux.vid.11=0x04D8
kilomux.pid.11=0xE7B7
kilomux.vid.12=0x04D8
kilomux.pid.12=0xE7B8
kilomux.vid.13=0x04D8
kilomux.pid.13=0xE7B9
kilomux.vid.14=0x04D8
kilomux.pid.14=0xE7BA
kilomux.vid.15=0x04D8
kilomux.pid.15=0xE7BB
#kilomux.upload.tool=bossac
#kilomux.upload.protocol=sam-ba
#kilomux.upload.maximum_size=262144
#kilomux.upload.use_1200bps_touch=true
#kilomux.upload.wait_for_upload_port=true
#kilomux.upload.native_usb=true
kilomux.build.mcu=cortex-m0plus
kilomux.build.f_cpu=48000000L
kilomux.build.usb_product="KilomuxV2"
kilomux.build.usb_manufacturer="Yaeltex"
kilomux.build.board=SAMD_ZERO
kilomux.build.core=arduino
kilomux.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
kilomux.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
kilomux.build.openocdscript=openocd_scripts/arduino_zero.cfg
kilomux.build.variant=kilomux
kilomux.build.variant_system_lib=
kilomux.build.extra_combine_flags=
kilomux.build.vid=0x04D8
kilomux.build.pid=0xEBBA
kilomux.bootloader.tool=
kilomux.bootloader.file=zero\samd21_sam_ba.bin

kilomux-test.name=Yaeltex Kilomux (test)
kilomux-test.vid.0=0x04D8
kilomux-test.pid.0=0xEBBA
kilomux-test.vid.1=0x04D8
kilomux-test.pid.1=0xEBCA
kilomux-test.vid.2=0x04D8
kilomux-test.pid.2=0xEBCB
kilomux-test.vid.3=0x04D8
kilomux-test.pid.3=0xEBCC
kilomux-test.vid.4=0x04D8
kilomux-test.pid.4=0xEBCD
kilomux-test.vid.5=0x04D8
kilomux-test.pid.5=0xEBCE
kilomux-test.vid.6=0x04D8
kilomux-test.pid.6=0xEBCF
kilomux-test.vid.7=0x04D8
kilomux-test.pid.7=0xEBD0
kilomux-test.vid.8=0x04D8
kilomux-test.pid.8=0xEBD1
kilomux-test.vid.9=0x04D8
kilomux-test.pid.9=0xEBDE
kilomux-test.vid.10=0x04D8
kilomux-test.pid.10=0xEBDF
kilomux-test.upload.tool=bossac
kilomux-test.upload.protocol=sam-ba
kilomux-test.upload.maximum_size=262144
kilomux-test.upload.use_1200bps_touch=true
kilomux-test.upload.wait_for_upload_port=true
kilomux-test.upload.native_usb=true
kilomux-test.build.mcu=cortex-m0plus
kilomux-test.build.f_cpu=48000000L
kilomux-test.build.usb_product="KilomuxV2"
kilomux-test.build.usb_manufacturer="Yaeltex"
kilomux-test.build.board=SAMD_ZERO
kilomux-test.build.core=arduino
kilomux-test.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
kilomux-test.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
kilomux-test.build.openocdscript=openocd_scripts/arduino_zero.cfg
kilomux-test.build.variant=kilomux-test
kilomux-test.build.variant_system_lib=
kilomux-test.build.extra_combine_flags=
kilomux-test.build.vid=0x04D8
kilomux-test.build.pid=0xEBBA
kilomux-test.bootloader.tool=openocd
kilomux-test.bootloader.file=zero\samd21_sam_ba.bin

